#+TITLE: Native Dependencies and Packages with Installs

While the vast majority of JavaScript projects "just work" out of the box when
you unpack them from a registry tarball, a few require =[pre|post]install=
scripts to be run to make themselves ready for use.

By default =floco= will run this /install phase/ in an isolated sandbox,
providing only declared =dependencies= and =optionalDependencies=, and a few
common tools such as =node=, =python3=, =jq=, =node-gyp=, and =stdenv=
( providing a C/C++ compiler, =make=, and other common utilities ).
This is often sufficient for most installs but some may also require "native"
libraries that aren't declared in manifests in a standard way, and instead get
mentioned in a =README=.

Unlike other JavaScript package managers - =floco= has a way to declare these
dependencies so that these builds can be run in a reproducible manner across
platforms; all we need to do is add a few fields to our config files.

*** Finding =libsodium= in Nixpkgs

Since we know that the build is going to look for =libsodium= on Darwin,
we need to make sure that we have =pkg-config= AND that =libsodium.pc=
is available in the build sandbox.
To provide these lets search in Nixpkgs a bit:

#+BEGIN_SRC shell :exports both :results output
nix search nixpkgs '\.libsodium';
#+END_SRC

#+RESULTS:
: * legacyPackages.aarch64-darwin.libsodium (1.0.18)
:   A modern and easy-to-use crypto library

Easy enough.
Now lets make see if =libsodium.pc= is provided in the default =output=,
or if we need to use a secondary output such as =lib= or =dev= to get the
=pkg-config= metadata.

#+BEGIN_SRC shell :exports both :results output
# Lets try the default output ( comes back empty )
find "$( nix build nixpkgs#libsodium --no-link --print-out-paths; )"  \
     -name '*.pc'|grep .||echo NONE;

# Lets look for alternative outputs.
nix eval nixpkgs#libsodium.outputs;

# Lets try `dev' ( BINGO! )
find "$( nix build nixpkgs#libsodium.dev --no-link --print-out-paths; )" \
     -name '*.pc'|grep .||echo NONE;
#+END_SRC

#+RESULTS:
: NONE
: [ "out" "dev" ]
: /nix/store/820s23l9i9lqksg1dsxyxjgcsi2q3gp0-libsodium-1.0.18-dev/lib/pkgconfig/libsodium.pc

This tells us we need to add =pkgs.libsodium.dev= for =pkg-config=
to resolve our library.


Next lets look for a shared library form of =libzmq=, being =libzmq.so=
on linux, or =libzmq.dylib= on Darwin.

#+BEGIN_SRC shell :exports both :results output
nix search nixpkgs '\.(libzmq|zeromq)';
#+END_SRC

#+RESULTS:
: * legacyPackages.aarch64-darwin.lispPackages_new.sbclPackages.zeromq (20160318-git)
: * legacyPackages.aarch64-darwin.lispPackages_new.sbclPackages.zeromq_dot_tests (20160318-git)
: * legacyPackages.aarch64-darwin.octavePackages.zeromq (7.3.0-zeromq-1.5.3)
:   ZeroMQ bindings for GNU Octave
: * legacyPackages.aarch64-darwin.zeromq (4.3.4)
:   The Intelligent Transport Layer
: * legacyPackages.aarch64-darwin.zeromq4 (4.3.4)
:   The Intelligent Transport Layer
#+end_example

The last two look right to me since the earlier results appear to be
modules/packages for =octave= and =LISP=.
Because both of the final results have the same version number and
description, my bet is that they're aliases of one another.

I have some concerns about the 4.x major version number though.
I'll cross my fingers and hope that the version number used by the JS
module doesn't necessarily correspond to the C library.
Like I said, I haven't packaged this before so this type of hiccup was
always a risk.

